SM_для_EDT/src/InformationRegisters/впПланГрафикППР/впПланГрафикППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впПланГрафикППР</name>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьАкт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.впОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.впВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительРемонта</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.vftСуда</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.впСпособыВыполненияРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ПланГрафик</name>
    <type>
      <types>DocumentRef.впПланГрафикРемонта</types>
      <types>DocumentRef.впВыявленныеДефекты</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РемонтноеМероприятие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/впАктыПоРемонтам/впАктыПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впАктыПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРемонтнойРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/впЗаявкиПоРемонтам/впЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Documents/впВыявленныеДефекты/впВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впВыявленныеДефекты</name>
  <basedOn>Document.впВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.впВыявленныеДефекты</basedOn>
  <basedOn>Document.впАктОВыполненииЭтапаРабот</basedOn>
  <registerRecords>InformationRegister.впВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.впУсловияВыявленияДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстраненияДефекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.впВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.впПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.впКритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.впВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.впВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/впВнешнееОснованиеДляРабот/впВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впВнешнееОснованиеДляРабот</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.vftСуда</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.впТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предписание_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/впЗакрытиеЗаявокИРемонтов/впЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗакрытиеЗаявокИРемонтов</name>
  <registerRecords>AccumulationRegister.впПроцентВыполненныхРабот</registerRecords>
  <registerRecords>InformationRegister.впОтмененныеПеренесенныеРемонты</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакрываемыеЗаявки</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.впПричиныЗакрытияЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗакрываемыеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.впВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.впПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
        <types>DocumentRef.впВыявленныеДефекты</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеПричины</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/CommonForms/впСписокРемонтов/Module.bsl
&НаКлиенте
Процедура РемонтныеРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ПолучитьМассивСтрок(Элементы.РемонтныеРаботы.ВыделенныеСтроки));
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивСтрок(ВыбранныеСтроки);
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр из Элементы.РемонтныеРаботы.ВыделенныеСтроки Цикл
		СтруктураСтроки = Новый Структура("ВидРемонтныхРабот, ОбъектРемонта, ДатаНачала, ДатаОкончания, ДокументИсточник, ID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, РемонтныеРаботы.НайтиПоИдентификатору(Стр));
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат МассивСтрок;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	ОбъектыРемонта.Добавить(Параметры.ОбъектРемонта);
	Если Параметры.Свойство("ID") ТОгда
		ID_Список.Добавить(Параметры.ID);
	КонецЕсли;
	//Период.ДатаНачала = НачалоМесяца(Параметры.ВладелецДата);
	//Период.ДатаОкончания = КонецМесяца(Параметры.ВладелецДата);
	//СписокИскл.Загрузить(Параметры.СписокИД.Выгрузить());
	Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	//Период.ДатаНачала = НачалоГода(ТекущаяДата());
	//Период.ДатаОкончания = КонецГода(ТекущаяДата());
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	ЗаполнитьТаблицуРемонтов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРемонтов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОбъектыРемонта", ОбъектыРемонта);
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	Запрос.УстановитьПараметр("ID", ID_Список);
	Запрос.УстановитьПараметр("НеИспользоватьID", ID_Список.Количество() = 0);
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впПланГрафикППР.УникальныйИдентификатор КАК ID,
	|	впПланГрафикППР.ДатаНачалаПлан КАК ДатаНачала,
	|	впПланГрафикППР.ДатаОкончанияПлан КАК ДатаОкончания,
	|	впПланГрафикППР.ОбъектРемонта КАК ОбъектРемонта,
	|	впПланГрафикППР.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	впПланГрафикППР.ПланГрафик КАК ДокументИсточник,
	|	ЛОЖЬ КАК ЗакрываетПредписание
	|ИЗ
	|	РегистрСведений.впПланГрафикППР КАК впПланГрафикППР
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО впПланГрафикППР.УникальныйИдентификатор = впАктыПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ впПланГрафикППР.Удален
	|	И НЕ впПланГрафикППР.Завершен
	|	И НЕ впПланГрафикППР.ЕстьЗаявка
	|	И впПланГрафикППР.ДатаНачалаПлан МЕЖДУ &НачПериода И &КонПериода
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	|	И впПланГрафикППР.ОбъектРемонта В ИЕРАРХИИ (&ОбъектыРемонта)
	//|	И впПланГрафикППР.ОбъектРемонта.ПодразделениеИсполнитель = &Подразделение
	|	И (впПланГрафикППР.УникальныйИдентификатор В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	впВыявленныеДефектыСписокДефектов.ID,
	|	впВыявленныеДефектыСписокДефектов.ДатаНачалаРемонта,
	|	впВыявленныеДефектыСписокДефектов.ДатаОкончанияРемонта,
	|	впВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
	|	впВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Значение,
	|	впВыявленныеДефектыСписокДефектов.Ссылка,
	|	впВыявленныеДефектыСписокДефектов.ЗакрываетПредписание
	|ИЗ
	|	Документ.впВыявленныеДефекты.СписокДефектов КАК впВыявленныеДефектыСписокДефектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.впВидРемонтаПриВводеНаОснованииВыявленныхДефектов КАК впВидРемонтаПриВводеНаОснованииВыявленныхДефектов
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗаявкиПоРемонтам КАК впЗаявкиПоРемонтам
	|		ПО впВыявленныеДефектыСписокДефектов.ID = впЗаявкиПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО впВыявленныеДефектыСписокДефектов.ID = впАктыПоРемонтам.IDРемонта
	|ГДЕ
	|	впЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И впВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение
	|	И впВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент В ИЕРАРХИИ (&ОбъектыРемонта)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впВыявленныеДефектыСписокДефектов.Ссылка.Проведен
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И НЕ впВыявленныеДефектыСписокДефектов.ID В (&ИД)
	|	И (впВыявленныеДефектыСписокДефектов.ID В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ID,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ПлановаяДатаРемонта,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта,
	|	впВидРемонтаПриВводеНаОснованииВнешнихОснований.Значение,
	|	впВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Документ.впВнешнееОснованиеДляРабот.ОбследованноеОборудование КАК впВнешнееОснованиеДляРаботОбследованноеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.впВидРемонтаПриВводеНаОснованииВнешнихОснований КАК впВидРемонтаПриВводеНаОснованииВнешнихОснований
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗаявкиПоРемонтам КАК впЗаявкиПоРемонтам
	|		ПО впВнешнееОснованиеДляРаботОбследованноеОборудование.ID = впЗаявкиПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО впВнешнееОснованиеДляРаботОбследованноеОборудование.ID = впАктыПоРемонтам.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.впВыявленныеДефекты.СписокДефектов КАК впВыявленныеДефектыСписокДефектов
	|		ПО впВнешнееОснованиеДляРаботОбследованноеОборудование.ID = впВыявленныеДефектыСписокДефектов.ID
	|ГДЕ
	|	впЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И впВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Подразделение = &Подразделение
	|	И впВнешнееОснованиеДляРаботОбследованноеОборудование.ОбъектРемонта В ИЕРАРХИИ (&ОбъектыРемонта)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впВнешнееОснованиеДляРаботОбследованноеОборудование.Ссылка.Проведен
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И НЕ впВнешнееОснованиеДляРаботОбследованноеОборудование.ID В (&ИД)
	|	И (впВнешнееОснованиеДляРаботОбследованноеОборудование.ID В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И впВыявленныеДефектыСписокДефектов.ID ЕСТЬ NULL
	// rarus evgenu 2020_12_01 ++ 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РемонтыОборудования.ID,
	|	РемонтыОборудования.ДатаНачала,
	|	РемонтыОборудования.ДатаОкончания,
	|	РемонтыОборудования.ОбъектРемонта,
	|	РемонтыОборудования.ВидРемонтныхРабот,
	|	РемонтыОборудования.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Документ.впЗаявкаНаРемонт.РемонтыОборудования КАК РемонтыОборудования
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗаявкиПоРемонтам КАК впЗаявкиПоРемонтам
	//|		ПО РемонтыОборудования.ID = впЗаявкиПоРемонтам.IDРемонта
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впАктыПоРемонтам КАК впАктыПоРемонтам
	|		ПО РемонтыОборудования.ID = впАктыПоРемонтам.IDРемонта
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.впВыявленныеДефекты.СписокДефектов КАК впВыявленныеДефектыСписокДефектов
	//|		ПО РемонтыОборудования.ID = впВыявленныеДефектыСписокДефектов.ID
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|ГДЕ
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	впЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	//|	И РемонтыОборудования.Ссылка.Подразделение = &Подразделение
	|	РемонтыОборудования.ОбъектРемонта В ИЕРАРХИИ (&ОбъектыРемонта)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И РемонтыОборудования.Ссылка.Проведен
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И НЕ РемонтыОборудования.ID В (&ИД)
	|	И (РемонтыОборудования.ID В (&ID) ИЛИ &НеИспользоватьID)
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	|	И впАктыПоРемонтам.IDРемонта ЕСТЬ NULL
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
	//|	И впВыявленныеДефектыСписокДефектов.ID ЕСТЬ NULL";
	|	";
	//RARUS-NN EvgenU РАIT-0023372 2021_06_04 --
	// rarus evgenu 2020_12_01 --
				   
	РемонтныеРаботы.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

// ++ rarus selmik 29.03.2021
&НаКлиенте
Процедура ОтображениеИерархииИКодаИерархии()
	Для Каждого СтрокаОбъектаРемонта Из РемонтныеРаботы Цикл
		
		ИерархияИКодИерархии = ПолучитьИерархиюИКодИерархииОбъектаРемонта(СтрокаОбъектаРемонта.ОбъектРемонта);
		ЗаполнитьЗначенияСвойств(СтрокаОбъектаРемонта, ИерархияИКодИерархии);
		
	КонецЦикла;	
КонецПроцедуры  // -- rarus selmik 29.03.2021

// ++ rarus selmik 29.03.2021
&НаСервере
Функция ПолучитьИерархиюИКодИерархииОбъектаРемонта(пОбъектРемонта)
	КодИерархии = "";
	Иерархия	= "";
	
	МассивРодителей = Новый Массив;
	
	Если ЗначениеЗаполнено(пОбъектРемонта) Тогда
		КодИерархии = пОбъектРемонта.рарусКодИерархии;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Родитель.Наименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(пОбъектРемонта.Родитель) Тогда
			МассивРодителей.Добавить(пОбъектРемонта.Родитель.Наименование);
		КонецЕсли;
	КонецЕсли;
	
	Счетчик = 0;
	Для Каждого ЭлементМассива Из МассивРодителей Цикл
		Если Счетчик < 2 Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		ИначеЕсли Счетчик = 2 Тогда
			Иерархия = ЭлементМассива;
		Иначе
			Иерархия = Иерархия + "->" + ЭлементМассива;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КодИерархии", КодИерархии);
	СтруктураВозврата.Вставить("Иерархия"	, Иерархия);
	
	Возврат СтруктураВозврата;
	
КонецФункции // -- rarus selmik 29.03.2021


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ЗаполнитьТаблицуРемонтов();
	// ++ rarus selmik 29.03.2021
	ОтображениеИерархииИКодаИерархии();
	// -- rarus selmik 29.03.2021
КонецПроцедуры

&НаКлиенте
Процедура РемонтныеРаботыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыборе(ПолучитьМассивСтрок(Элементы.РемонтныеРаботы.ВыделенныеСтроки));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ++ rarus selmik 29.03.2021
	ОтображениеИерархииИКодаИерархии();
	// -- rarus selmik 29.03.2021
	
	// ++ rarus selmik 29.09.2021 РАIT-0023505
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса();
	// -- rarus selmik 29.09.2021 РАIT-0023505
КонецПроцедуры

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура НастройкаВидимостиУточненияПричиныЗакрытияПереноса()
	Если ПричинаЗакрытия = ПредопределенноеЗначение("Справочник.впПричиныЗакрытияРемонтов.Прочее") Тогда
		Элементы.УточнениеПричиныПереноса.Видимость = Истина;
		Элементы.УточнениеПричиныЗакрытия.Видимость = Истина;
	Иначе
		Элементы.УточнениеПричиныПереноса.Видимость = Ложь;
		Элементы.УточнениеПричиныЗакрытия.Видимость = Ложь;
		УточнениеПричиныЗакрытияПереноса = "";
	КонецЕсли;
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ПеренестиОтменить(ПараметрыПереносаОтмены)
	
	ЗакрываемыеРемонты = Новый СписокЗначений;
	Для Каждого ВыделеннаяСтрока Из Элементы.РемонтныеРаботы.ВыделенныеСтроки Цикл
		ТекущиеДанные = РемонтныеРаботы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтруктураДанных = Новый Структура("Отменен, Перенесен, НоваяДатаНачала, НоваяДатаОкончания, ПричинаЗакрытия, УточнениеПричины");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ПараметрыПереносаОтмены);
		
		СтруктураДанных.Вставить("ОбъектРемонта", ТекущиеДанные.ОбъектРемонта);
		СтруктураДанных.Вставить("ВидРемонта", ТекущиеДанные.ВидРемонтныхРабот);
		СтруктураДанных.Вставить("ДатаНачала", ТекущиеДанные.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", ТекущиеДанные.ДатаОкончания);
		СтруктураДанных.Вставить("ДокументОснование", ТекущиеДанные.ДокументИсточник);
		СтруктураДанных.Вставить("ID", ТекущиеДанные.ID);
		
		ЗакрываемыеРемонты.Добавить(СтруктураДанных, 
			СтрШаблон("%1 %2 %3 %4", 
				Строка(ТекущиеДанные.ОбъектРемонта), 
				Строка(ТекущиеДанные.ВидРемонтныхРабот), 
				Строка(ТекущиеДанные.ДатаНачала), 
				Строка(ТекущиеДанные.ДатаОкончания)));
	КонецЦикла;
	ЗначенияЗаполнения = Новый Структура("ЗакрываемыеРемонты", ЗакрываемыеРемонты);		
	ОткрытьФорму("Документ.впЗакрытиеЗаявокИРемонтов.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект,
		1,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "впЗакрытиеЗаявокИРемонтов_Запись"  
		//RARUS-NN EvgenU РАIT-0023371 2021_06_11 ++   
		ИЛИ ИмяСобытия = "впАктОВыполненииЭтапаРабот_Запись" Тогда
		//RARUS-NN EvgenU РАIT-0023371 2021_06_11 --
		ЗаполнитьТаблицуРемонтов();
		// ++ rarus selmik 29.03.2021
		ОтображениеИерархииИКодаИерархии();
		// -- rarus selmik 29.03.2021

	ИначеЕсли ИмяСобытия = "ДобавитьОбъектРемонтаДляЗакрытияПереноса" 
		И ТипЗнч(Параметр) = Тип("Структура")
		И Параметр.Свойство("ОбъектРемонта") Тогда
		
		Если Параметр.Свойство("ID") ТОгда
			ID_Список.Добавить(Параметр.ID);
		КонецЕсли;
		ОбъектыРемонта.Добавить(Параметр.ОбъектРемонта);
		ЗаполнитьТаблицуРемонтов();
		// ++ rarus selmik 29.03.2021
		ОтображениеИерархииИКодаИерархии();
		// -- rarus selmik 29.03.2021
		Источник.СписокРемонтовУжеОткрыт = Истина;
	КонецЕсли;
	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура Отменить(Команда)
	ПараметрыПереносаОтмены = Новый Структура;
	ПараметрыПереносаОтмены.Вставить("Отменен", ИСТИНА);
	ПараметрыПереносаОтмены.Вставить("ПричинаЗакрытия"	, ПричинаЗакрытия);
	ПараметрыПереносаОтмены.Вставить("УточнениеПричины"	, УточнениеПричиныЗакрытияПереноса);
	ПеренестиОтменить(ПараметрыПереносаОтмены);	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура Перенести(Команда)
	ПараметрыПереносаОтмены = Новый Структура;
	ПараметрыПереносаОтмены.Вставить("Перенесен"			, ИСТИНА);
	ПараметрыПереносаОтмены.Вставить("ПричинаЗакрытия"		, ПричинаЗакрытия);
	ПараметрыПереносаОтмены.Вставить("НоваяДатаНачала"		, ПериодПереноса.ДатаНачала);
	ПараметрыПереносаОтмены.Вставить("НоваяДатаОкончания"	, ПериодПереноса.ДатаОкончания);
	ПараметрыПереносаОтмены.Вставить("НоваяДатаОкончания"	, ПериодПереноса.ДатаОкончания);
	ПараметрыПереносаОтмены.Вставить("УточнениеПричины"		, УточнениеПричиныЗакрытияПереноса);
	ПеренестиОтменить(ПараметрыПереносаОтмены);	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023371 2021_06_11 ++
&НаКлиенте
Процедура Акт(Команда)

	РемонтыОборудования = Новый СписокЗначений;
	Для Каждого ВыделеннаяСтрока Из Элементы.РемонтныеРаботы.ВыделенныеСтроки Цикл
		ТекущиеДанные = РемонтныеРаботы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтруктураДанных = Новый Структура();
		//ЗаполнитьЗначенияСвойств(СтруктураДанных, ПараметрыПереносаОтмены);
		
		СтруктураДанных.Вставить("ОбъектРемонта", ТекущиеДанные.ОбъектРемонта);
		СтруктураДанных.Вставить("ВидРемонтныхРабот", ТекущиеДанные.ВидРемонтныхРабот);
		СтруктураДанных.Вставить("ДатаНачала", ТекущиеДанные.ДатаНачала);
		СтруктураДанных.Вставить("ДатаОкончания", ТекущиеДанные.ДатаОкончания);
		СтруктураДанных.Вставить("ДокументИсточник", ТекущиеДанные.ДокументИсточник);
		СтруктураДанных.Вставить("ID", ТекущиеДанные.ID);
		
		РемонтыОборудования.Добавить(СтруктураДанных, 
			СтрШаблон("%1 %2 %3 %4", 
				Строка(ТекущиеДанные.ОбъектРемонта), 
				Строка(ТекущиеДанные.ВидРемонтныхРабот), 
				Строка(ТекущиеДанные.ДатаНачала), 
				Строка(ТекущиеДанные.ДатаОкончания)));
	КонецЦикла;
	ЗначенияЗаполнения = Новый Структура("РемонтыОборудования", РемонтыОборудования);		
	ОткрытьФорму("Документ.впАктОВыполненииЭтапаРабот.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект,
		1,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023371 2021_06_11 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура РемонтныеРаботыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.РемонтныеРаботы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПериодПереноса.ДатаНачала = ТекДанные.ДатаНачала;
		ПериодПереноса.ДатаОкончания = ТекДанные.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ПериодПереносаДатаНачалаПриИзменении(Элемент)
	Если ПериодПереноса.ДатаНачала > ПериодПереноса.ДатаОкончания Тогда
		ПериодПереноса.ДатаОкончания = ПериодПереноса.ДатаНачала;
	КонецЕсли;
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

//RARUS-NN EvgenU РАIT-0023372 2021_06_04 ++
&НаКлиенте
Процедура ПериодПереносаДатаОкончанияПриИзменении(Элемент)
	Если ПериодПереноса.ДатаНачала > ПериодПереноса.ДатаОкончания Тогда
		ПериодПереноса.ДатаНачала = ПериодПереноса.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры //RARUS-NN EvgenU РАIT-0023372 2021_06_04 --

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура ПричинаЗакрытия1ПриИзменении(Элемент)
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса();
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505

// ++ rarus selmik 29.09.2021 РАIT-0023505
&НаКлиенте
Процедура ПричинаЗакрытияПриИзменении(Элемент)
	НастройкаВидимостиУточненияПричиныЗакрытияПереноса()
КонецПроцедуры // -- rarus selmik 29.09.2021 РАIT-0023505
